app/controllers/games_controller.rb

SELECT "games".* FROM "games"
SELECT "players".* FROM "players"
---
  def index
    games = Game.all
    players = Player.all

SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT 1  [["id", 0]]
---
  def show
    game = Game.find(params[:id])